*** Hello World
#+begin_src js
  print("hello world");
#+end_src

#+RESULTS:
: hello world

*** Defining a function
#+begin_src js
  function myfunc() {
    return 42;
  }
  print(myfunc();
#+end_src

#+RESULTS:
: 42

*** Local and global variables
#+begin_src js
  x = 1
  function myfunc() {
    x = 2
  }
  myfunc();
  print(x);
#+end_src

#+RESULTS:
: 2
: undefined


#+begin_src js
  x = 1
  function myfunc() {
    var x = 2
  }
  myfunc();
  print(x);
#+end_src

#+RESULTS:
: 1

*** The for loop
#+begin_src js
  function myfunc() {
    for(i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4

#+begin_src js
  i = -1;
  function myfunc() {
    for(i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
  print("---");
  print(i);
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: ---
: 5


#+begin_src js
  i = -1;
  function myfunc() {
    for(var i = 0; i < 5; i++) {
      print(i);
    }
  }
  
  myfunc();
  print("---");
  print(i);
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: ---
: -1

